Repository: jmichault/flash_cc2531
Catalog: docs/_locale/*/index.md.po
Languages: eo

source: fr
eo: eo

source: fonto
eo: auto

source: L'essentiel!
eo: La esenca!

source: L'essentiel
eo: La ĉefa afero

source: _flash\_cc2531_ vous permet de programmer votre clé USB CC2531 à partir de votre _Raspberry_, sans avoir besoin d'un _Arduino_ ou d'un _CC Debugger_.
eo: _flash\_cc2531_ permesas al vi programi vian CC2531 USB-bastonon de via _Raspberry_, sen bezono aŭ de _Arduino_ aŭ de _CC Debugger_.

source: Prérequis
eo: Antaŭkondiĉo

source: Vous avez besoin d'un _Raspberry_ ou d'un _Odroid-c2_.
eo: Vi bezonas aŭ _Raspberry_ aŭ _Odroid-c2_.

source: Vous avez besoin de quoi connecter le port de débogage de la clé aux ports _GPIO_ du _Raspberry_, par exemple un câble _CC_ et quatre lignes _Dupont_ (voir plus loin). [ _WiringPi_ ](http://wiringpi.com/) doit être installé \(s'il n'est pas pré-installé, vous pouvez généralement l'installer avec `sudo apt install wiringpi`, sinon voir [le site Web de _Gordon_ ](http://wiringpi.com/) ou [ce site alternatif](https://github.com/WiringPi/WiringPi) \).
eo: Vi bezonas kion por konekti la elpurigan havenon de la ŝlosilo al la havenoj _GPIO_ de _Raspberry_, ekzemple unu kablo _CC_ kaj kvar linioj _Dupont_ (vidu plu). [ _WiringPi_ ](http://wiringpi.com/) devas esti instalita \(se ĝi ne estas antaŭinstalita, vi kutime povas instali ĝin per `sudo apt install wiringpi`), alie vidu [la retejon de _Gordon_ ](http://wiringpi.com/) aŭ [ĉi tiun alternativan retejon](https://github.com/WiringPi/WiringPi) \).

source: Enfin il vous faut le logiciel :
eo: Fine vi bezonas la programon:

source: en général un coordinateur zigbee : [ version 1.2 (recommandée)](https://github.com/Koenkk/Z-Stack-firmware/raw/master/coordinator/Z-Stack_Home_1.2/bin/default/) ou [version 3.0](https://github.com/Koenkk/Z-Stack-firmware/tree/master/coordinator/Z-Stack_3.0.x/bin)
eo: ĝenerale zigbee-kunordiganto: [ versio 1.2 (rekomendita)](https://github.com/Koenkk/Z-Stack-firmware/raw/master/coordinator/Z-Stack_Home_1.2/bin/default/) aŭ [versio 3.0](https://github.com/Koenkk/Z-Stack-firmware/tree/master/coordinator/Z-Stack_3.0.x/bin)

source: ou alors un routeur zigbee : [routeur zigbee 1.2](https://github.com/Koenkk/Z-Stack-firmware/tree/master/router/CC2531/bin)
eo: aŭ zigbee-enkursigilo: [zigbee-enkursigilo 1.2](https://github.com/Koenkk/Z-Stack-firmware/tree/master/router/CC2531/bin)

source: J'ai conçu _flash\_cc2531_ sur un _Raspberry Pi 3_ avec _raspbian_, mais des programmations réussies ont été signalées sur d'autres modèles:
eo: Mi projektis _flash\_cc2531_ sur _Raspberry Pi 3_ kun _raspbian_, sed sukcesa programado estis raportita pri aliaj modeloj:

source: sur pi 4, vous aurez besoin de la version 2.52 de _wiringpi_ : [installer _wiringPi_ 2.52 depuis le site Web de _Gordon_ ](http://wiringpi.com/wiringpi-updated-to-2-52-for-the-raspberry-pi-4b/)
eo: sur pi 4 vi bezonos version 2.52 de _wiringpi_ : [instalu _wiringPi_ 2.52 de _Gordon_ ](http://wiringpi.com/wiringpi-updated-to-2-52-for-the-raspberry-pi-4b/)retejo

source: sur pi 1 et pi 2, vous devrez [utiliser d'autres broches](#uzi_aliajn_pinglojn).
eo: sur pi 1 kaj pi 2 vi bezonos [uzi aliajn pinglojn](#uzi_aliajn_pinglojn).

source: dans tous les cas, vous devrez probablement ajuster l'option de base de temps ( _"-m"_ ).
eo: ĉiuokaze vi probable bezonos agordi la tempan bazan opcion ( _"-m"_ ).

source: Préparation
eo: Preparado

source: Téléchargez _flash\_cc2531_ sur votre _raspberry_ :
eo: Elŝutu _flash\_cc2531_ al via _raspberry_ :

source: Connectez les broches suivantes du port de débogage au port GPIO:
eo: Konektu la jenajn pinglojn de la debug-haveno al la GPIO-haveno:

source: broche 1 ( _GND_ ) -> broche 39 ( _GND_ )
eo: pinglo 1 ( _GND_ ) -> pinglo 39 ( _GND_ )

source: broche 7 ( _reset_ ) -> broche 35 ( _wPi 24, BCM19_ )
eo: pinglo 7 ( _reset_ ) -> pinglo 35 ( _wPi 24, BCM19_ )

source: broche 3 ( _DC_ ) -> broche 36 ( _wPi 27, BCM16_ )
eo: pinglo 3 ( _DC_ ) -> pinglo 36 ( _wPi 27, BCM16_ )

source: broche 4 ( _DD_ ) -> broche 38 ( _wPi 28, BCM20_ )
eo: pinglo 4 ( _DD_ ) -> pinglo 38 ( _wPi 28, BCM20_ )

source: et insérez la clé USB dans un port.
eo: kaj enmetu la USB-ŝlosilon en havenon.

source: Un câble de téléchargement _CC_ et 4 lignes _Dupont_ Femelle à Femelle sont parfaits à cet effet : ![photo de la clé et du _raspberry_ ](https://github.com/jmichault/files/raw/master/Raspberry-CC2531.jpg) C'est mon option préférée, mais si vous n'avez pas de câble _CC_ vous pouvez aussi souder directement les câbles _Dupont_ sur la clé : voir par exemple le site [ _lemariva.com_ ](https://lemariva.com/blog/2019/08/zigbee-flashing-cc2531-using-raspberry-pi-without-cc-debugger) ou [ _notenoughtech.com_ ](https://notenoughtech.com/home-automation/flashing-cc2531-without-cc-debugger )
eo: Elŝuta kablo _CC_ kaj 4 linioj _Dupont_ Ino al Ino estas perfektaj por ĉi tiu celo: ![foto de la ŝlosilo kaj la _raspberry_ ](https://github.com/jmichault/files/raw/master/Raspberry-CC2531.jpg) Ĉi tiu estas mia plej ŝatata opcio, sed se vi ne havas kablon _CC_ vi ankaŭ povas rekte luti la kablojn _Dupont_ sur la ŝlosilo: vidu ekzemple la retejon [ _lemariva.com_ ](https://lemariva.com/blog/2019/08/zigbee-flashing-cc2531-using-raspberry-pi-without-cc-debugger) aŭ [ _notenoughtech.com_ ](https://notenoughtech.com/home-automation/flashing-cc2531-without-cc-debugger )

source: testez en exécutant ceci :
eo: provu per ĉi tio:

source: Ça doit retourner:
eo: Ĝi devas reveni:

source: Si vous voyez 0000 ou ffff quelque chose ne va pas:
eo: Se vi vidas 0000 aŭ ffff io fiaskas:

source: vérifiez d'abord votre câblage.
eo: unue kontrolu vian kabligon.

source: puis essayez un temps de base plus élevé, par exemple avec `./cc_chipid -m 100`, ou `./cc_chipid -m 160` ou `./cc_chipid -m 300`.
eo: tiam provu pli altan bazan tempon, ekzemple kun `./cc_chipid -m 100`, aŭ `./cc_chipid -m 160` aŭ `./cc_chipid -m 300`.

source: si rien de tout cela ne fonctionne, essayez de recompiler avec `make`.
eo: se neniu el tio funkcias, provu rekompili kun `make`.

source: utilisation
eo: uzado

source: Pour enregistrer le contenu de la mémoire flash dans le fichier save.hex:
eo: Por konservi la enhavon de la fulmmemoro en la dosiero save.hex:

source: (dure environ 1 minute).
eo: (daŭras ĉirkaŭ 1 minuton).

source: Pour effacer la mémoire flash:
eo: Por viŝi fulmmemoron:

source: **Remarque:** Vous **devez** effacer avant d'écrire (sauf si vous savez vraiment ce que vous allez faire).
eo: **Noto:** Vi **devas** forviŝi antaŭ skribado (krom se vi vere scias, kion vi faros).

source: Pour programmer le fichier _CC2531ZNP-Prod.hex_ sur la clé _CC2531_:
eo: Por programi la dosieron _CC2531ZNP-Prod.hex_ sur la klavo _CC2531_:

source: (dure environ 3 minutes).
eo: (daŭras ĉirkaŭ 3 minutojn).

source: Utiliser d'autres broches
eo: Uzi aliajn pinglojn

source: toutes les commandes acceptent les arguments suivants:
eo: ĉiuj ordonoj akceptas la jenajn argumentojn:

source: _-c_ broche : change la broche _DC_ (par défaut 27)
eo: _-c_ pinglo: ŝanĝu la pinglon _DC_ (defaŭlte 27)

source: _-d_ broche : change la broche _DD_ (par défaut 28)
eo: _-d_ pinglo: ŝanĝu la pinglon _DD_ (defaŭlte 28)

source: _-r_ broche : change la broche _reset_ (par défaut 24)
eo: _-r_ pinglo: ŝanĝu la pinglon _reset_ (defaŭlte 24)

source: _-m_ : change le multiplicateur du délai, et donc le temps de base (par défaut : ajustement automatique)
eo: _-m_ : ŝanĝu la prokrastan multiplikaton, kaj do la bazan tempon (defaŭlte: aŭtomata ĝustigo)

source: la numérotation des broches utilisée est celle de _wiringPi_. Utilisez `gpio readall` pour avoir la disposition dans votre _Raspberry_ (colonne _wPi_ ).
eo: la pinglonumerado uzata estas tiu de _wiringPi_. Uzu `gpio readall` por havi la aranĝon en via _Raspberry_ (kolumno _wPi_ ).

source: Par exemple, si vous souhaitez utiliser les broches 3, 11 et 13:
eo: Ekzemple, se vi volas uzi pinglojn 3, 11 kaj 13:

source: Connectez les broches suivantes d'un port de débogage à une porte _GPIO_:
eo: Konekti la jenajn pinglojn de elpuriga haveno al pordo _GPIO_:

source: broche 1 ( _GND_ ) -> broche 14 ( _GND_ )
eo: pinglo 1 ( _GND_ ) -> pinglo 14 ( _GND_ )

source: broche 7 ( _reset_ ) -> broche 3 ( _wPi 8, BCM2_ )
eo: pinglo 7 ( _reset_ ) -> pinglo 3 ( _wPi 8, BCM2_ )

source: broche 3 ( _DC_ ) -> broche 11 ( _wPi 0, BCM17_ )
eo: pinglo 3 ( _DC_ ) -> pinglo 11 ( _wPi 0, BCM17_ )

source: broche 4 ( _DD_ ) -> broche 13 ( _wPi 2, BCM27_ )
eo: pinglo 4 ( _DD_ ) -> pinglo 13 ( _wPi 2, BCM27_ )

source: et maintenant vous pouvez lire l'ID, sauvegarder , effacer et écrire la mémoire flash avec les commandes suivantes:
eo: kaj nun vi povas legi identigilon, konservi, forigi kaj skribi fulmmemoron per la jenaj komandoj:

source: Vous pouvez également changer les valeurs par défaut dans _CCDebugger.h_ puis compiler les programmes avec `make`.
eo: Vi ankaŭ povas ŝanĝi la defaŭltajn valorojn en _CCDebugger.h_ kaj kompili la programojn per `make`.

source: et si ça ne marche pas?
eo: kio se ĝi ne funkcias?

source: arrêtez tous les autres programmes.
eo: ĉesu ĉiujn aliajn programojn.

source: fixez la vitesse du processeur avant la programmation. Exemple:
eo: agordu la rapidon de la procesoro antaŭ programado. Ekzemplo:

source: utilisez l'option -m pour augmenter les délais utilisés. Exemple:
eo: uzu la opcion -m por pliigi la uzatajn tempolimojn. Ekzemplo:

source: recompilez le logiciel avec `make`.
eo: rekompili la programon per `make`.

source: Licence
eo: Permesilo

source: Ce projet est sous licence GPL v3 ( voir _COPYING_ ).
eo: Ĉi tiu projekto estas rajtigita laŭ GPL v3 ( vidu _COPYING_ ).
